SH6_43_msh2/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.8e+07;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            uniformTotalPressure;
        rho             none;
        psi             none;
        gamma           1.4364;
        pressure        tableFile;
        pressureCoeffs
        {
            fileName        "$FOAM_RUN/SH5_43mps_MFR_newBC/outlet0.2_42.7mps_fromCapture.dat";
        }
        value           uniform 1.8e+07;
    }
    sides
    {
        type            empty;
    }
    walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
